#/usr/bin/perl -w
################################################
##2019-4-8
##解决的问题:基于转录本ID号提取序列
##步骤:1.根据fasta文件构建哈希,key为ID,序列为value 2.读入ID文件，判断是否在哈希中,存在即打印
##技巧:设置行分隔符,可以将多行序列文件做为一个整行读入
##存在的问题:在18行代码if语句要包含建立哈希的过程弄了半天
################################################

my ($file,$id) = @ARGV;
open IN,"$file" or die "$!";
my %info;
#use Data::Dumper;
#$/=">";<IN>;$/="\n";
while (my $line=<IN>) {
	chomp;
	#my $id=$1 if ($line=~/^(\S+)/);
######################之前错误的写法######################################
	#	if ($line=~ /^(\S+)/) {
	#		my $id=$1;
	#	}
	#	$/=">";
	#	my $fa =<IN>;
	#	$fa=~s/>|\r|\*//g;
	#	$/="\n";
	#	$info{$id}=$fa
#########################################################################
	
	if ($line=~ /^(\S+)/) {
		my $id=$1;
		#$/ 当前输入记录分隔符,默认情况是新行
		$/=">";
		my $fa =<IN>;
		$fa=~s/>|\r|\*//g;
		$/="\n";
		$info{$id}=$fa;
		#$/="\n";
	}
}
close IN;
#$/="\n";
open IN,"$id" or die "$!";
while (<IN>) {
	chomp;
	if (exists $info{$_}) {
		print "$_\n$info{$_}\n";
	
	}


}

close IN;


#foreach (keys %info) {
#
#	print "$_\n$info{$_}\n";
#
#
#}
#my @keys= keys %info;
#$"="\n";
#print "@keys[1..10]";
#print "$info{'AT4G39460.2'}"
